title: Intelligence Settings
description: The declaration to configure Apple Intelligence settings.
payload:
  declarationtype: com.apple.configuration.intelligence.settings
  supportedOS:
    iOS:
      introduced: '26.4'
      allowed-enrollments:
      - supervised
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes: []
    macOS:
      introduced: '26.4'
      allowed-enrollments:
      - supervised
      allowed-scopes:
      - system
      - user
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '26.4'
      allowed-enrollments:
      - supervised
      allowed-scopes:
      - system
    watchOS:
      introduced: n/a
  apply: combined
  content: Configures Apple Intelligence settings.
payloadkeys:
- key: AllowAppleIntelligenceReport
  title: Allow Apple Intelligence Report
  type: <boolean>
  presence: optional
  default: true
  combinetype: boolean-and
  content: If `false`, disables Apple Intelligence Report.
- key: AllowGenmoji
  title: Allow Genmoji
  type: <boolean>
  presence: optional
  default: true
  combinetype: boolean-and
  content: If `false`, disables Genmoji.
- key: AllowImagePlayground
  title: Allow Image Playground
  type: <boolean>
  presence: optional
  default: true
  combinetype: boolean-and
  content: If `false`, disables Image Playground.
- key: AllowImageWand
  title: Allow Image Wand
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  combinetype: boolean-and
  content: If `false`, disables Image Wand.
- key: AllowPersonalizedHandwritingResults
  title: Allow Personalized Handwriting Results
  supportedOS:
    macOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  combinetype: boolean-and
  content: If `false`, disables Personalized Handwriting Results.
- key: AllowVisualIntelligenceSummary
  title: Allow Visual Intelligence Summary
  supportedOS:
    macOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  combinetype: boolean-and
  content: If `false`, disables Visual Intelligence Summary.
- key: AllowWritingTools
  title: Allow Writing Tools
  type: <boolean>
  presence: optional
  default: true
  combinetype: boolean-and
  content: If `false`, disables Writing Tools.
- key: Apps
  title: Apps
  type: <dictionary>
  presence: optional
  content: If present, configures app-specific Intelligence features.
  subkeys:
  - key: Mail
    title: Mail
    type: <dictionary>
    presence: optional
    content: If present, configures Mail Intelligence features.
    subkeys:
    - key: AllowSmartReplies
      title: Allow Smart Replies
      type: <boolean>
      presence: optional
      default: true
      combinetype: boolean-and
      content: If `false`, disables Mail Smart Replies.
    - key: AllowSummary
      title: Allow Summary
      type: <boolean>
      presence: optional
      default: true
      combinetype: boolean-and
      content: If `false`, disables Mail Summary.
  - key: Notes
    title: Notes
    type: <dictionary>
    presence: optional
    content: If present, configures Notes Intelligence features.
    subkeys:
    - key: AllowTranscription
      title: Allow Transcription
      supportedOS:
        visionOS:
          introduced: n/a
      type: <boolean>
      presence: optional
      default: true
      combinetype: boolean-and
      content: If `false`, disables Notes Transcription.
    - key: AllowTranscriptionSummary
      title: Allow Transcription Summary
      supportedOS:
        visionOS:
          introduced: n/a
      type: <boolean>
      presence: optional
      default: true
      combinetype: boolean-and
      content: If `false`, disables Notes Transcription Summary.
  - key: Safari
    title: Safari
    type: <dictionary>
    presence: optional
    content: If present, configures Safari intelligence features.
    subkeys:
    - key: AllowSummary
      title: Allow Summary
      type: <boolean>
      presence: optional
      default: true
      combinetype: boolean-and
      content: If `false`, disables Safari Summary.
- key: ForceOnDeviceOnlyDictation
  title: Force On-Device Only Dictation
  type: <boolean>
  presence: optional
  default: false
  combinetype: boolean-or
  content: If `true`, forces On-Device Only Dictation.
- key: ForceOnDeviceOnlyTranslation
  title: Force On-Device Only Translation
  supportedOS:
    macOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  combinetype: boolean-or
  content: If `true`, forces On-Device Only Translation.
