title: Legacy Interactive Profile
description: The declaration to configure an interactive legacy profile.
payload:
  declarationtype: com.apple.configuration.legacy.interactive
  supportedOS:
    iOS:
      introduced: '15.0'
      allowed-enrollments:
      - supervised
      - device
      - user
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes: []
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - supervised
      - user
      allowed-scopes:
      - system
      - user
    tvOS:
      introduced: '16.0'
      allowed-enrollments:
      - supervised
      - device
      allowed-scopes:
      - system
    visionOS:
      introduced: '1.1'
      allowed-enrollments:
      - supervised
      - device
      - user
      allowed-scopes:
      - system
    watchOS:
      introduced: n/a
  apply: multiple
payloadkeys:
- key: ProfileURL
  title: Profile's URL.
  type: <string>
  presence: required
  content: |-
    The URL of the profile to download and install, which needs to start with `https://`, and must be hosted by the MDM server.

    If a user enrollment triggers this configuration, the system silently ignores any MDMv1 payloads in macOS that are forbidden with user enrollment. In iOS, the system rejects the entire profile.
- key: VisibleName
  title: Configuration Visible Name
  type: <string>
  presence: required
  content: The visible name of the configuration. This name needs to indicate the
    nature of the profile.
notes:
- title: ''
  content: |-
    This declaration specifies an MDMv1 profile to present to the user, who may choose to download and install the profile.

    The profile may contain any payload type other than the following:

    - `com.apple.mdm`
    - `com.apple.declarations`
