title: SkipKeys
description: The definition of all the available skip keys
payload:
  payloadtype: SkipKeys
  supportedOS:
    iOS:
      introduced: '7.0'
      always-skippable: true
    macOS:
      introduced: '10.9'
      always-skippable: true
    tvOS:
      introduced: '10.2'
      always-skippable: true
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: Accessibility
  title: Skip Accessibility pane
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '11.0'
      always-skippable: false
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Accessibility pane, when creating additional users.
    This key is not available in macOS.
- key: ActionButton
  title: Skip Action Button setup pane
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Action Button configuration pane. This key is available
    in iOS 17 and later.
- key: Android
  title: Prevents migration from Android device
  supportedOS:
    iOS:
      introduced: '9.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: If the Restore pane isn't skipped, this is the key to remove the Move from
    Android option in the Restore pane on iOS. This key is available in iOS 9 and
    later.
- key: Appearance
  title: Skip Choose your Look setup pane
  supportedOS:
    iOS:
      introduced: '13.0'
    macOS:
      introduced: '10.14'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Choose Your Look screen. This key is available in iOS
    13+ and macOS 10.14 and later.
- key: AppleID
  title: Disables signing in to an Apple Account and iCloud
  type: <string>
  presence: optional
  content: The key to skip Apple Account setup. This key is available in iOS 7.0+,
    tvOS 10.2 and later, and macOS 10.9 and later.
- key: AppStore
  title: Skips AppStore information pane
  supportedOS:
    iOS:
      introduced: '14.3'
    macOS:
      introduced: '11.1'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the App Store pane. This key is available in iOS 14.3 and
    later, and macOS 11.1 and later.
- key: Biometric
  title: Skips Touch ID/Face ID setup
  supportedOS:
    iOS:
      introduced: '8.1'
    macOS:
      introduced: 10.12.4
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip biometric setup. This key is available in iOS 8.1 and later,
    and macOS 10.12.4 and later.
- key: CameraButton
  title: Skips Camera Control pane
  supportedOS:
    iOS:
      introduced: '18.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Camera Button pane. This key is available in iOS 18
    and later.
- key: DeviceToDeviceMigration
  title: Skip Device To Device Migration pane
  supportedOS:
    iOS:
      introduced: '12.4'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip Device to Device Migration pane. This key is available
    in iOS 13 and later.
- key: Diagnostics
  title: Disables automatically sending diagnostic information
  type: <string>
  presence: optional
  content: The key to skip the App Analytics pane. This key is available in iOS 7
    and later, tvOS 10.2 and later, and macOS 10.9 and later.
- key: DisplayTone
  title: Disables True Tone
  supportedOS:
    iOS:
      introduced: 9.3.2
      deprecated: '15.0'
    macOS:
      introduced: 10.13.6
      deprecated: '12.0'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip DisplayTone setup. This key is available in iOS 9.3.2 and
    later, and macOS 10.13.6 and later, and deprecated in iOS 15 and macOS 12.
- key: EnableLockdownMode
  title: Skips Enable Lockdown Mode
  supportedOS:
    iOS:
      introduced: '17.1'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Lockdown Mode pane if an Apple Account is set up. Available
    in iOS 17.1 and later, and macOS 14 and later.
- key: FileVault
  title: Skip configuration of FileVault
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.10'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to disable the FileVault Setup Assistant screen in macOS. This
    key is available in macOS 10.10 and later.
- key: HomeButtonSensitivity
  title: Skips Home Button sensitivity setup
  supportedOS:
    iOS:
      introduced: '10.0'
      deprecated: '15.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Meet the New Home Button screen on iPhone 7, iPhone
    7 Plus, iPhone 8, iPhone 8 Plus, and iPhone SE. This key is available in iOS 10
    and later, and deprecated in iOS 15.
- key: iCloudDiagnostics
  title: Skip iCloud Analytics pane
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: 10.12.4
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the iCloud Analytics screen. This key is available in macOS
    10.12.4 and later.
- key: iCloudStorage
  title: Skip iCloud Documents and Desktop pane
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: 10.13.4
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the iCloud Documents and Desktop screen in macOS. This
    key is available in macOS 10.13.4 and later.
- key: iMessageAndFaceTime
  title: Skip iMessage and FaceTime set up pane
  supportedOS:
    iOS:
      introduced: '12.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the iMessage and FaceTime screen in iOS. This key is available
    in iOS 12 and later.
- key: Intelligence
  title: Skip Intelligence setup pane
  supportedOS:
    iOS:
      introduced: '18.0'
    macOS:
      introduced: '15.0'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Intelligence pane. This key is available in iOS 18
    and later and macOS 15 and later.
- key: Keyboard
  title: Skip Keyboard pane
  supportedOS:
    iOS:
      introduced: '13.0'
      always-skippable: false
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Keyboard pane. This pane isn't always skippable because
    it appears before the device retrieves the Cloud Configuration from the server.
    This key is available in iOS 13 and later.
- key: Location
  title: Disables Location Services
  supportedOS:
    macOS:
      introduced: '10.11'
  type: <string>
  presence: optional
  content: The key to disable Location Services. This key is available in iOS 7 and
    later, and macOS 10.11 and later.
- key: MessagingActivationUsingPhoneNumber
  title: Disables iMessage activation using a phone number in select regions
  supportedOS:
    iOS:
      introduced: '10.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the iMessage pane. This key is available in iOS 10 and
    later.
- key: OnBoarding
  title: Skip on-boarding informational panes
  supportedOS:
    iOS:
      introduced: '11.0'
      deprecated: '14.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the on-boarding informational screens for user education
    (Go Home, Cover Sheet, Multitasking & Control Center, for example) in iOS. This
    key is available in iOS 11 and later, and deprecated in iOS 14.
- key: Passcode
  title: Skips prompting the user to set a passcode
  supportedOS:
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to hide and disable the passcode pane. This key is available in
    iOS 7 and later.
- key: Payment
  title: Skips Apple Pay setup
  supportedOS:
    iOS:
      introduced: '8.1'
    macOS:
      introduced: 10.12.4
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip Apple Pay setup. This key is available in iOS 8.1 and later,
    and macOS 10.12.4 and later.
- key: Privacy
  title: Skip Privacy pane
  supportedOS:
    iOS:
      introduced: '11.3'
    macOS:
      introduced: 10.13.4
    tvOS:
      introduced: '11.3'
  type: <string>
  presence: optional
  content: The key to skip the privacy pane. This key is available in iOS 11.13 and
    later, tvOS 11.13 and later, and macOS 10.13.4 and later.
- key: Restore
  title: Disables restoring from backup
  supportedOS:
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to disable restoring from backup. This key is available in iOS
    7 and later, and macOS 10.9 and later.
- key: RestoreCompleted
  title: Skips Restore Completed pane
  supportedOS:
    iOS:
      introduced: '14.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Restore Completed pane. This key is available in iOS
    14 and later.
- key: ScreenSaver
  title: Skips screen saver setup
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the tvOS screen about using aerial screensavers in ATV.
    This key is available in tvOS 10.2 and later.
- key: Safety
  title: Skips Safety pane
  supportedOS:
    iOS:
      introduced: '16.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Safety pane. This key is available in iOS 16 and later.
- key: SafetyAndHandling
  title: Skips Safety and Handling pane
  supportedOS:
    iOS:
      introduced: '18.4'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: If the key is included in the SkipSetup array the Safety and Handling pane
    will be skipped.
- key: ScreenTime
  title: Skip Screen Time pane
  supportedOS:
    iOS:
      introduced: '12.0'
    macOS:
      introduced: '10.15'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Screen Time pane. This key is available in iOS 12 and
    later, and macOS 10.15 and later.
- key: SIMSetup
  title: Skip SIM-related setup
  supportedOS:
    iOS:
      introduced: '12.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the add cellular plan pane. Skipping this pane prevents
    automatic eSIM setup during Setup Assistant. This key is available in iOS 12 and
    later.
- key: Siri
  title: Disables Siri
  supportedOS:
    macOS:
      introduced: '10.12'
  type: <string>
  presence: optional
  content: The key to disable Siri. This key is available in iOS 7 and later, tvOS
    10.2 and later, and macOS 10.12 and later.
- key: SoftwareUpdate
  title: Skip automatic software update configuration pane
  supportedOS:
    iOS:
      introduced: '12.0'
    macOS:
      introduced: '15.4'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the mandatory software update screen in iOS. This key is
    available in iOS 12 and later.
- key: SpokenLanguage
  title: Skip Dictation pane
  supportedOS:
    iOS:
      introduced: '13.0'
      always-skippable: false
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Dictation pane. This pane isn't always skippable because
    it appears before the device retrieves the Cloud Configuration from the server.
    This key is available in iOS 13 and later.
- key: TapToSetup
  title: Skips simplified tap setup
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: n/a
    tvOS:
      always-skippable: false
  type: <string>
  presence: optional
  content: The key to skip the Tap To Set Up option in Apple TV related to using an
    iOS device to set up your Apple TV. This key is available in tvOS 10.2 and later.
- key: TermsOfAddress
  title: Skips Terms of Address
  supportedOS:
    iOS:
      introduced: '16.0'
      always-skippable: false
    macOS:
      introduced: '13.0'
      always-skippable: false
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Terms of Address pane. This key isn't always skippable
    because this pane appears before the device retrieves the Cloud Configuration
    from the server. This key is available in iOS 16 and later, and macOS 13 and later.
- key: TOS
  title: Skips Terms and Conditions
  type: <string>
  presence: optional
  content: The key to skip Terms and Conditions. This key is available in iOS 7 and
    later, tvOS 10.2 and later, and macOS 10.9 and later.
- key: TVHomeScreenSync
  title: Skip TV Home Screen
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: n/a
    tvOS:
      introduced: '11.0'
  type: <string>
  presence: optional
  content: The key to skip TV home screen layout sync screen. This key is available
    in tvOS 11 and later.
- key: TVProviderSignIn
  title: Skip TV provider sign in
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: n/a
    tvOS:
      introduced: '11.0'
  type: <string>
  presence: optional
  content: The key to skip the TV provider sign in screen. This key is available in
    tvOS 11 and later.
- key: TVRoom
  title: Skip Where is this Apple TV pane
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: n/a
    tvOS:
      introduced: '11.4'
  type: <string>
  presence: optional
  content: The key to skip the “Where is this Apple TV?” screen in tvOS. This key
    is available in tvOS 11.4 and later.
- key: UpdateCompleted
  title: Skips Software Update Complete pane
  supportedOS:
    iOS:
      introduced: '14.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Software Update Complete pane. This key is available
    in iOS 14 and later.
- key: Wallpaper
  title: Skips Wallpaper selection
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '14.1'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: |-
    The key to skip Wallpaper setup.
    This key is available in macOS 14.1 and later,
- key: WatchMigration
  title: Skip watch migration
  supportedOS:
    iOS:
      introduced: '11.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the screen for watch migration. This key is available in
    iOS 11 and later.
- key: WebContentFiltering
  title: Skip web content filtering pane
  supportedOS:
    iOS:
      introduced: '18.2'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: If the key is included in the SkipSetup array the Web Content Filtering
    pane will be skipped.
- key: Welcome
  title: Skip Get Started pane
  supportedOS:
    iOS:
      introduced: '13.0'
    macOS:
      introduced: '15.0'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip the Get Started pane. This key is available in iOS 13 and
    later and macOS 15 and later.
- key: Zoom
  title: Skips setting zoom configuration
  supportedOS:
    iOS:
      introduced: '8.3'
      deprecated: '17.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The key to skip zoom setup. This key is available in iOS 8.3 and later,
    and deprecated in iOS 17.
